app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test2"], ["introduction", "aaaaa"], ["updated_at", "2024-06-07 19:30:36.300066"], ["id", 1]]